let knowledge = [
  /*1-10*/
  [
    "Малахит",
    "- это",
    "неорганическое соединение, основная соль металла меди и угольной кислоты с формулой (CuOH)<sub>2</sub>CO<sub>3</sub>, тёмно-зелёные кристаллы, нерастворимые в воде.",
  ],
  [
    "Неорганические соединения",
    "- это",
    "простые вещества и соединения, не являющиеся органическими, то есть, не содержащие углерода, а также некоторые углеродсодержащие соединения.",
  ],
  [
    "Малахит",
    "получают",
    "из природы, из меди, пропусканием углекислоты через суспензию гидроксида меди, реакцией сульфата меди и гидрокарбоната натрия.",
  ],
  [
    "Малахит",
    "выглядит",
    "<img width='100' height='50' src='../resources/malahit.jpg'/>",
  ],
  ["Гидроксокарбонат меди(II)", "- это", "другое название малахита."],
  ["Малахит", "состоит", "из соли металла меди и угольной кислоты."],
  [
    "Природный малахит",
    "выглядит",
    "<img width='100' height='50' src='../resources/malahit.jpg'/>",
  ],
  [
    "Лабораторный малахит",
    "выглядит",
    "<img width='100' height='50' src='../resources/malahit-powder.jpg'/>",
  ],
  ["Формула малахита", "выглядит", "так: (CuOH)<sub>2</sub>CO<sub>3</sub>"],
  [
    "Формула реакции меди с воздухом",
    "выглядит",
    "так: 2Cu + CO<sub>2</sub> + O<sub>2</sub> + H<sub>2</sub>O → (CuOH)<sub>2</sub>CO<sub>3</sub>↓",
  ],
  /*11-20*/
  [
    "Формула реакции пропускания углекислоты через суспензию гидроксида меди",
    "выглядит",
    "так: 2(CuOH)<sub>2</sub> + CO<sub>2</sub> → (CuOH)<sub>2</sub>CO<sub>3</sub>↓ + H<sub>2</sub>O",
  ],
  [
    "Формула реакции сульфата меди и гидрокарбоната натрия",
    "выглядит",
    "так: 2CuSO<sub>4</sub> + 4NaHCO<sub>3</sub> → (CuOH)<sub>2</sub>CO<sub>3</sub>↓ + 2Na<sub>2</sub>SO<sub>4</sub> + 3CO<sub>2</sub>↑ + H<sub>2</sub>O",
  ],
  [
    "Химические свойства малахита",
    "бывают",
    "следующими: разложение при нагревании, реакция с кислотами, реакция с солями аммония и раствором аммиака, реакция с цианистым калием, реакция с оксидом углерода (IV) под давлением, растворяется в избытке горячего концентрированного раствора карбоната натрия с образованием синего раствора, при охлаждении из которого кристаллизуется вегшайдерит, окрашенный в синий цвет тетрагидроксокупратом натрия",
  ],
  [
    "В симуляторе",
    "проводится ",
    "опыт по разложению малахита при нагревании.",
  ],
  ["Установка", "является", "нагревательной"],
  [
    "Установка",
    "состоит",
    "лабораторного штатива с зажимом, пробирок, спиртовки, газоотводной трубки, штатива для пробирок.",
  ],
  [
    "Зажим для пробирок",
    "нужен",
    "чтобы держать пробирку над спиртовкой, пока вещество (малахит) в ней будет нагреваться.",
  ],
  [
    "Газоотводная трубка",
    "нужна",
    "чтобы доказать, что выделяется углекислый газ.",
  ],
  ["После полного разложения малахита", "образуется", "оксид меди(II) - CuO"],
  [
    "Hаствор серной кислоты",
    "добавляется",
    "чтобы проверить, что в растворе содержится медь.",
  ],
  /*21-30*/
  ["Раствор", "окрасится", "в синий цвет."],
  [
    "Пробирка",
    "нужна",
    "чтобы поместить вещества для дальнейших манипуляций с ними.",
  ],
  ["Спиртовка", "нужна", "чтобы нагревать растворы и вещества"],
  [
    "Газоотводная трубка",
    "нужна",
    "чтобы проводить выделяющийся газ для дальнейших манипуляций с ним",
  ],
  [
    "Штатив для пробирок",
    "нужен",
    "чтобы держать пробирки для дальнейшего использования",
  ],
  [
    "Реакция разложения",
    "- это",
    "химическая реакция, в которой из одного, более сложного вещества образуются два или более других, более простых веществ.",
  ],
  ["Реакцию разложения", "вызывает", "нагревание"],
  [
    "Виды реакций разложения",
    "бывают",
    "такие: биодеградация, сольволиз, радиолиз, термолиз, электролиз, и др.",
  ],
  [
    "Формула реакции разложения малахита при нагревании",
    "выглядит",
    "так: (CuOH)<sub>2</sub>CO<sub>3</sub> → 2CuO + CO<sub>2</sub> + H<sub>2</sub>O",
  ],
  [
    "Формула реакции малахита с кислотами",
    "выглядит",
    "так: (CuOH)<sub>2</sub>CO<sub>3</sub> + 4HCl → 2CuCl<sub>2</sub> + CO<sub>2</sub>↑ + 3H<sub>2</sub>O",
  ],
  /*31-40*/
  [
    "Формула реакции малахита с солью аммония",
    "выглядит",
    "так: (CuOH)<sub>2</sub>CO<sub>3</sub> + 4NH<sub>4</sub>Cl → 2CuCl<sub>2</sub>",
  ],
  [
    "Формула реакции малахита с раствором аммиака",
    "выглядит",
    "так: (CuOH)<sub>2</sub>CO<sub>3</sub> + 8(NH<sub>3</sub>•H<sub>2</sub>O) → [Cu(NH<sub>3</sub>)<sub>4</sub>]CO<sub>3</sub> + [Cu(NH<sub>3</sub>)<sub>4</sub>](OH)<sub>2</sub> + 8H<sub>2</sub>O",
  ],
  [
    "Формула реакции малахита с цианистым калием",
    "выглядит",
    "так: (CuOH)<sub>2</sub>CO<sub>3</sub> + 8KCN → 2K<sub>2</sub>[Cu(CN)<sub>4</sub>] + K<sub>2</sub>CO<sub>3</sub> + 2KOH",
  ],
  [
    "Формула реакции малахита с оксидом углерода под давлением",
    "выглядит",
    "так: (CuOH)<sub>2</sub>CO<sub>3</sub> + CO<sub>2</sub> → 2CuCO<sub>3</sub>+ H<sub>2</sub>O",
  ],
  [
    "Формула реакции растворения малахита в избытке горячего концентрированного раствора карбоната натрия",
    "выглядит",
    "так: (CuOH)<sub>2</sub>CO<sub>3</sub> + 7Na<sub>2</sub>CO<sub>3</sub> + 6H<sub>2</sub>O → 2Na<sub>5</sub>[CO<sub>3</sub>](HCO<sub>3</sub>)<sub>3</sub> + 2Na<sub>2</sub>[Cu(OH)<sub>4</sub>]",
  ],
  ["Формула углекислого газа", "выглядит", "так: CO<sub>2</sub>."],
  ["Раствор", "окрашивается", "в синий цвет, так как в нем содержится медь."],
  [
    "Лабораторный штатив с зажимом",
    "выглядит",
    "<img width='150' height='150' src='../resources/rack.jpg'/>",
  ],
  [
    "Пробирка",
    "выглядит",
    "<img width='150' height='150' src='../resources/test-tube.jpg'/>",
  ],
  [
    "Спиртовка",
    "выглядит",
    "<img width='170' height='150' src='../resources/spiritlamp.jpg'/>",
  ],
  /*41-50*/
  [
    "Газоотводная трубка",
    "выглядит",
    "<img width='170' height='150' src='../resources/gaz tube.jpg'/>",
  ],
  [
    "Штатив для пробирок",
    "выглядит",
    "<img width='170' height='150' src='../resources/tubesRack.jpg'/>",
  ],
  [
    "Автором симулятора",
    "является",
    "Потапейко Полина, студентка БГТУ 3 курса факультета ИТ специальности ИСиТ",
  ],
  [
    "Нагревание",
    "- это",
    "естественный или искусственный физический процесс повышения температуры.",
  ],
  [
    "Соль",
    "- это",
    "сложное вещество, состоящее из катионов металлов и анионов кислотных остатков.",
  ],
  [
    "Основная соль",
    "- это",
    "продукт неполного замещения гидроксильных групп в молекулах многокислотных оснований кислотными остатками.",
  ],
  [
    "Металл",
    "- это",
    "химический элемент, обладающий в виде простого вещества при нормальных условиях характерными металлическими свойствами, такими как высокие тепло- и электропроводность, положительный температурный коэффициент сопротивления, высокая пластичность, ковкость и характерный металлический блеск.",
  ],
  ["Формула угольной кислоты", "выглядит", "так: H<sub>2</sub>CO<sub>3</sub>"],
  [
    "Угольная кислота",
    "- это",
    "слабая двухосновная кислота, образуется в малых количествах при растворении углекислого газа в воде, в том числе и углекислого газа из воздуха. В водных растворах неустойчива.",
  ],
  [
    "Простое вещество",
    "- это",
    "химическое вещество, состоящее исключительно из атомов одного химического элемента, в отличие от сложного вещества.",
  ],
  /*51-60*/
  [
    "Органические соединения",
    "- это",
    "вещества, относящиеся к углеводородам или их производным, то есть это класс химических соединений, объединяющий почти все химические соединения, в состав которых входит углерод.",
  ],
  ["Формула гидроксида меди", "выглядит", "так: Cu(OH)<sub>2</sub>"],
  ["Формула сульфата меди", "выглядит", "так: CuSO<sub>4</sub>"],
  ["Формула гидрокарбоната натрия", "выглядит", "так: NaHCO<sub>3</sub>"],
  [
    "Кислота",
    "- это",
    "химическое соединение, способное отдавать катион водорода, либо соединение, способное принимать электронную пару с образованием ковалентной связи.",
  ],
  [
    "Аммоний",
    "- это",
    "полиатомный катион с химической формулой NH<sub>4</sub><sup>+</sup>",
  ],
  [
    "Соли аммония",
    "- это",
    "соли, содержащие аммоний, NH<sub>4</sub><sup>+</sup>; по строению, цвету и другим свойствам похожи на соответствующие соли натрия.",
  ],
  [
    "Аммиак",
    "- это",
    "бинарное неорганическое химическое соединение азота и водорода, при нормальных условиях — бесцветный газ с резким характерным запахом.",
  ],
  ["Формула аммиака", "выглядит", "так: NH<sub>3</sub>"],
  ["Цианистый калий", "- это", "калиевая соль синильной кислоты."],
  /*61-70*/
  ["Формула цианистого калия", "выглядит", "так: KCN"],
  [
    "Оксид углерода",
    "- это",
    "химическое соединение, бесцветный токсичный газ без вкуса и запаха, легче воздуха.",
  ],
  [
    "Оксид",
    "- это",
    "бинарное соединение химического элемента с кислородом в степени окисления −2, в котором сам кислород связан только с менее электроотрицательным элементом.",
  ],
  ["Формула оксида углерода", "выглядит", "так: CO"],
  [
    "Концентрированный раствор",
    "- это",
    "раствор с высоким содержанием растворённого вещества в противоположность разбавленному раствору, содержащему малое количество растворённого вещества.",
  ],
  [
    "Сложное вещество",
    "- это",
    "вещество, состоящее из атомов двух и более разных химических элементов.",
  ],
  [
    "Карбонат натрия",
    "- это",
    "неорганическое соединение, натриевая соль угольной кислоты.",
  ],
  ["Формула карбоната натрия", "выглядит", "так: Na<sub>2</sub>CO<sub>3</sub>"],
  [
    "Кристаллизация",
    "- это",
    "процесс образования кристаллов из газов, растворов, расплавов или стёкол. Кристаллизацией называют также образование кристаллов с данной структурой из кристаллов иной структуры или процесс перехода из жидкого состояния в твёрдое кристаллическое.",
  ],
  ["Вегшайдерит", "- это", "минерал, названный в честь Вегшайдера"],
  /*71-80*/
  [
    "Формула вегшайдерита",
    "выглядит",
    "так: Na<sub>5</sub>[CO<sub>3</sub>](HCO<sub>3</sub>)<sub>3</sub>",
  ],
  [
    "Тетрагидроксокупрат натрия",
    "- это",
    "неорганическое соединение, комплексный гидроксид натрия и меди",
  ],
  [
    "Формула тетрагидроксокупрата натрия",
    "выглядит",
    "так: Na<sub>2</sub>[Cu(OH)<sub>4</sub>]",
  ],
  [
    "Биодеградация",
    "- это",
    "разрушение сложных веществ, материалов, продуктов в результате деятельности живых организмов; чаще всего при упоминании биодеградации подразумевается действие микроорганизмов, грибов, водорослей.",
  ],
  [
    "Сольволиз",
    "- это",
    "реакция обменного разложения между растворенным веществом и растворителем.",
  ],
  [
    "Радиолиз",
    "- это",
    "разложение химических соединений под действием ионизирующих излучений.",
  ],
  [
    "Термолиз",
    "- это",
    "процесс разложения химических соединений под воздействием температуры без применения катализаторов.",
  ],
  [
    "Алкоголиз",
    "- это",
    "общее название для группы обменных реакций между различными органическими соединениями и спиртами. Алкоголиз с участием метанола называют метанолизом, с участием этанола — этанолизом и т. д.",
  ],
  [
    "Гидролиз",
    "- это",
    "химическая реакция взаимодействия вещества с водой, в результате которой происходит разложение этого вещества и воды с образованием новых соединений.",
  ],
  [
    "Пиролиз",
    "- это",
    "разложение органических природных соединений при недостатке кислорода.",
  ],
  /*81-90*/
  [
    "Электролиз",
    "- это",
    "физико-химический процесс, состоящий в выделении на электродах составных частей растворённых веществ или других веществ, являющихся результатом вторичных реакций на электродах, который возникает при прохождении электрического тока через раствор либо расплав электролита.",
  ],
  ["Малахит", "был открыт", "в 1635 г."],
  ["Малахит", "используют", "для создания поделок и ювелирных украшений."],
  ["Малахит", "впервые был найден ", "в предгорьях Урала."],
  [
    "Природный малахит",
    "образуется",
    "в зонах окисления скарновых и стратиформных медно-сульфидных месторождений и чаще всего там, где медные руды выходят на земную поверхность. Особенно крупные залежи малахита образуются там, где медная руда залегает среди известняков.",
  ],
  [
    "Скарновые месторождения",
    "- это",
    "скарны, содержащие ценные минералы, в количестве и по качеству достаточные для экономически целесообразной разработки.",
  ],
  [
    "Скарны",
    "- это",
    "высокотемпературнаые контактово-метасоматические горные породы, сложенные специфическими известковыми или магнезиально-железистыми силикатами.",
  ],
  [
    "Силикаты",
    "- это",
    "природные или искусственные соединения, содержащие кремнезем.",
  ],
  [
    "Месторождения малахита",
    "находятся",
    "на Урале (Меднорудянское и Гумишевское практически выработаны), в Африке, в Южной Австралии и в США.",
  ],
  [
    "Сорта малахита",
    "бывают",
    "следующими: «бирюзовый»; зеленый, глубокого корпусного тона; темно-зеленый, черно-зеленый «бархатный», «атласный», «плисовый», имеющий в изломе шелковистый блеск и хуже полирующийся",
  ],
  /*91-100*/
  [
    "Плисовый малахит",
    "образуется",
    "в трещинах или нарастает на обломки кремнистых пород.",
  ],
  [
    "Плисовый малахит",
    "выглядит",
    "<img width='100' height='50' src='../resources/malahit-turquoise.jpg'/>",
  ],
  [
    "Бирюзовый малахит",
    "выглядит",
    "<img width='100' height='50' src='../resources/malahit-pliss.jpg'/>",
  ],
  [
    "Контактово-метасоматические горные породы",
    "- это",
    "породы, образованные в зоне влияния флюидов и тепла магматического тела на вмещающие породы, а также продукты влияния магматогенного флюида на ранее закристаллизованные магматические породы.",
  ],
  [
    "Магнезиально-железистые силикаты",
    "- это",
    "растворы силикатов натрия или едкого натра.",
  ],
  [
    "Катион",
    "- это",
    "положительно заряженный ион. Характеризуется величиной положительного электрического заряда.",
  ],
  [
    "Анион",
    "- это",
    "отрицательно заряженный ион. Отрицательный заряд обусловлен избытком электронов по сравнению с количеством протонов. Заряд аниона дискретен и выражается в единицах элементарного отрицательного электрического заряда.",
  ],
  [
    "Синильная кислота",
    "- это",
    "бесцветная, очень летучая, легкоподвижная ядовитая жидкость, имеющая неприятный запах. Синильная кислота содержится в некоторых растениях, коксовом газе, табачном дыме, выделяется при термическом разложении нейлона, полиуретанов.",
  ],
  ["Формула синильной кислоты", "выглядит", "так: HCN"],
  ["Ионы", "- это", "атомы или молекулы, которые имеют электрический заряд."],
  [
    "Озвученная карта установки",
    "выглядит",
    "следующим образом: <iframe src='../resources/StructureMapCopy_HTML5 Canvas.html' width='380' height='700' style='margin-left: -100px; margin-top: -160px; margin-bottom: -160px; transform: scale(0.5)'></iframe>",
  ],
  [
    "Анимационный ролик",
    "выглядит",
    "следующим образом: <iframe src='../resources/StructureScheme_HTML5 Canvas.html' width='380' height='700' style='margin-left: -100px; margin-top: -160px; margin-bottom: -160px; transform: scale(0.5)'></iframe>",
  ],
];

let endings = [
  ["ет", "(ет|ут|ют)"],
  ["ут", "(ет|ут|ют)"],
  ["ют", "(ет|ут|ют)"],

  ["ит", "(ит|ат|ят)"],
  ["ат", "(ит|ат|ят)"],
  ["ят", "(ит|ат|ят)"],

  ["ется", "(ет|ут|ют)ся"],
  ["утся", "(ет|ут|ют|ующие)ся"],
  ["ются", "(ет|ут|ют)ся"],

  ["ится", "(ит|ат|ят)ся"],
  ["атся", "(ит|ат|ят)ся"],
  ["ятся", "(ит|ат|ят)ся"],

  ["ящие", "ящие"],
  ["ee", "ee"],
  ["ен", "ен"],
  ["ую", "ая"],
  ["му", "ма"],
  ["ена", "ена"],
  ["ено", "ено"],
  ["ены", "ены"],

  ["ан", "ан"],
  ["ая", "ую"],
  ["ана", "ана"],
  ["ано", "ано"],
  ["аны", "аны"],

  ["жен", "жен"],
  ["жна", "жна"],
  ["жно", "жно"],
  ["жны", "жны"],

  ["какой", "какой"],
  ["какая", "какая"],
  ["где", "страна"],
  ["какова", "какова"],
  ["такое", "является"],
  ["такое", "- это"],
  ["такой ", "- это"],
  ["кто", "кто"],
  ["как", "чтобы"],
  ["виды", "вида"],
  ["основан", "основан"],
  ["равна", "равна"],

  ["ов", ""],
];

let blacklist = ["замена", "замены", "атрибут", "маршрут", "член", "нет"];

function imgConstructor(path) {
  return '<img src="' + path + '"></img>"';
}

function getEndingIndex(word) {
  if (blacklist.indexOf(word) !== -1) return -1;

  for (let i = 0; i < endings.length; i++)
    if (word.substring(word.length - endings[i][0].length) == endings[i][0])
      return i;

  return -1;
}

function firstSymbolToLowerCase(str) {
  return str.substring(0, 1).toLowerCase() + str.substring(1);
}

function firstSymbolToUpperCase(str) {
  return str.substring(0, 1).toUpperCase() + str.substring(1);
}

function getAnswer(question) {
  let text = firstSymbolToLowerCase(question);
  let separators = "'\",.!?()[]\\/";
  for (let i = 0; i < separators.length; i++)
    text = text.replace(separators[i], " " + separators[i]);

  let words = text.split(" ");

  for (let i = 0; i < words.length; i++)
    words[i] = firstSymbolToLowerCase(words[i]);

  let result = false;
  let answer = "";

  for (let i = 0; i < words.length; i++) {
    let ending = getEndingIndex(words[i]);

    if (ending >= 0) {
      words[i] =
        words[i].substring(0, words[i].length - endings[ending][0].length) +
        endings[ending][1];

      console.log(words);

      let predicate = new RegExp(".*" + words[i] + ".*");

      if (endings[ending][0] == endings[ending][1]) {
        if (words[i] != "нужен") {
          predicate = new RegExp(".*" + words[i] + " " + words[i + 1] + ".*");
          i++;
        }
      }
      console.log(predicate);

      let subjectReg = words.slice(i + 1).join(".*");
      console.log(subjectReg);

      if (subjectReg.length > 3) {
        let subject = new RegExp(".*" + subjectReg + ".*");
        console.log(subject);

        for (let j = 0; j < knowledge.length; j++) {
          if (
            predicate.test(knowledge[j][1].toLowerCase()) &&
            (subject.test(knowledge[j][0].toLowerCase()) ||
              subject.test(knowledge[j][2].toLowerCase()))
          ) {
            answer += firstSymbolToUpperCase(
              knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]
            );
            result = true;
            break;
          }
        }

        if (!result) {
          for (let j = 0; j < knowledge.length; j++) {
            if (
              subject.test(
                knowledge[j][0].toLowerCase() ||
                  subject.test(knowledge[j][2].toLowerCase())
              )
            ) {
              answer += firstSymbolToUpperCase(
                knowledge[j][0] + " " + knowledge[j][1] + " " + knowledge[j][2]
              );
              result = true;
              break;
            }
          }
        }
      }
    }
  }

  if (!result) answer = "Ответ не найден.";

  return answer;
}

//переменная, используемая для активизации диалога
var dialogOn = false;

//ФУНКЦИЯ ФОРМИРОВАНИЯ ДИАЛОГОВОГО ОКНА
function prepare_environment() {
  //добавляем на страницу новый раздел div с идентификатором dialog, задаем //ему CSS-стиль dialog и надвигаем его левое поле на страницу на 25px
  document.body.innerHTML +=
    "<div id='dialog' class='dialog' style='margin-left:-25px;'>" +
    //добавляем в этот раздел новый раздел со строкой  «Нажми, чтобы спросить!», //задаем ему CSS-стиль label и команду на выполнение функции выдвижения        //диалогового окна toggleDialog() щелчком мыши
    "<div class='label' onclick='toggleDialog()'>Задать вопрос</div>" +
    //добавляем туда же новый раздел со строкой  «История» и задаем ему CSS-стиль //header
    "<div class='header'>Диалог с базой знаний</div>" +
    //добавляем туда же новый раздел, задаем ему ему CSS-стиль history и задаем ему //идентификатор history
    "<div class='history' id='history'></div>" +
    //добавляем туда же новый раздел, задаем ему ему CSS-стиль question, поле //формы с начальным текстом,исчезающим при щелчке мышью и идентификатором //Qdialog, а также кнопкой «Спросить» с командой для запуска функции ask()

    "<div class='question'><input id='Qdialog' placeholder='Введите вопрос'/><br>" +
    "<button onclick='ask(\"Qdialog\")'>Спросить</button></div>" +
    //закрываем общий блок для диалогового окна div
    "</div>";

  //КРУПНЫЙ ПЛАН ИЗОБРАЖЕНИЙ НА СТРАНИЦЕ ПОСЛЕ ЩЕЛЧКА МЫШИ ПО НИМ В ОКНЕ ДИАЛОГА
  document.body.innerHTML +=
    //добавляем на страницу новый блок div с CSS-стилем imgalert и стилем
    "<div id='imgalert'  style='display:none'>" +
    //добавляем в этот раздел новый раздел div с CSS-стилем bg и скрытием //предыдущего раздела после щелчка мышью по фону функцией hide()
    "<div class='bg' onclick='hide(\"imgalert\")'>&nbsp;</div>" +
    //добавление на страницу рисунка с CSS-стилем img_in_alert
    "<img id='img_in_alert' src='' />" +
    //закрытие общего раздела для крупного плана изображений
    "</div>";

  // Задаем API-ключ для модуля распознавания речи Яндекса
  window.ya.speechkit.settings.apikey = "5c6d6536-b453-4589-9bc7-f16c7a795106";

  // Добавление элемента управления "Поле для голосового ввода".
  var textline = new ya.speechkit.Textline("Qdialog", {
    onInputFinished: function (text) {
      // вставка текста после распознавания в созданное текстовое поле Qdialog.
      document.getElementById("Qdialog").value = text;
    },
  });
}

function toggleDialog() {
  if (dialogOn) {
    //закрытие
    $("#dialog").animate({ "margin-left": "-25px" }, 1000, function () {});
    dialogOn = false;
  } else {
    //открытие
    $("#dialog").animate({ "margin-left": "-300px" }, 1000, function () {});
    dialogOn = true;
    clearInterval(timer);
  }
}

function ask(questionInput) {
  //переменная для считывания содержания окна ввода вопроса
  var question = document.getElementById(questionInput).value;
  //активизация диалога
  dialogOn = true;
  //создание поля для ввода вопроса в новом блоке <div>
  var newDiv = document.createElement("div");
  //задание класса стиля оформления созданного блока для вопроса
  newDiv.className = "question";
  //заполнение созданного блока текстом вопроса
  newDiv.innerHTML = question;
  //добавление созданного блока в блок диалога
  document.getElementById("history").appendChild(newDiv);
  //создание поля для вывода ответа в новом блоке <div>
  newDiv = document.createElement("div");
  //задание класса стиля оформления созданного блока для ответа
  newDiv.className = "answer";
  //получение ответа на вопрос и заполнение им созданного блока ответа
  newDiv.innerHTML = getAnswer(question);
  //создание нового раздела с тегом для воспроизведения звука <audio>
  newDiv.innerHTML +=
    "<audio style='width: 180px; height: 20px' controls='true' autoplay='true' src='http://tts.voicetech.yandex.net/generate?format=wav&lang=ru-RU&key=4a4d3a13-d206-45fc-b8fb-e5a562c9f587&text=" +
    newDiv.innerText +
    "'></audio>";

  //добавление созданного раздела в диалоговое окно  history
  document.getElementById("history").appendChild(newDiv);

  //запуск звука из созданного раздела
  if (newDiv.lastChild.tagName == "AUDIO") {
    newDiv.lastChild.play();
  }

  //добавление созданного блока в блок диалога
  document.getElementById("history").appendChild(newDiv);
  //прокрутка истории в самый низ
  document.getElementById("history").scrollTop =
    document.getElementById("history").scrollHeight;
  //очистка текстового поля для ввода нового вопроса
  document.getElementById(questionInput).value = "";
}
